<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_9(7%EC%9B%9431%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
student_list = [{'name': 'John',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Nate',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Edward',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Zara',
                 'major': "Psychology",
                 'sex': "female"},
                {'name': 'John',
                 'major': "Computer Science",
                 'sex': "male"},
                ]
df = pd.DataFrame(student_list, columns = ['name', 'major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [3]:
df.duplicated() # 중복된 행 알아보기(True라는 값이 중복된 것)

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [5]:
df.drop_duplicates() # 중복된 값 제거하기

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [6]:
student_list = [{'name': 'John',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Nate',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Edward',
                 'major': "Computer Science",
                 'sex': "male"},
                {'name': 'Zara',
                 'major': "Psychology",
                 'sex': "female"},
                {'name': 'Wendy',
                 'major': "Economics",
                 'sex': "female"},
                {'name': 'Nate',
                 'major': None,
                 'sex': "male"},
                {'name': 'John',
                 'major': "Economics",
                 'sex': "male"},
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [7]:
# 열에 있는 값을 알아내어 중복된 값 없애기

In [8]:
df.duplicated() # True 값 없음(정확하게 일치하는 행이 존재하지 않음)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [9]:
df.duplicated(['name']) # name이 중복된 것이라고 하면 True 값이 나옴

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [10]:
df.drop_duplicates(['name'], keep = 'first') # 앞에 있는 것만 남게 됨

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

In [11]:
df.drop_duplicates(['name'], keep = 'last') # 뒤의 것 유지

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [12]:
df.drop_duplicates(['name']) # keep 부분 생략하면 뒤의 것은 지워짐

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female